Комплексная_автоматизация_2_МОМ_2019/src/Reports/СбалансированностьПлановУП/СбалансированностьПлановУП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СбалансированностьПлановУП</name>
</mdclass:Report>

Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/ОчередьРасчетаПланаПроизводства/ОчередьРасчетаПланаПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьРасчетаПланаПроизводства</name>
  <resources>
    <name>УдалитьКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСценарий</name>
    <type>
      <types>CatalogRef.СценарииТоварногоПланирования</types>
    </type>
  </resources>
  <resources>
    <name>ПересчитатьВсеПотребности</name>
    <comment>Истина - фоновое проведение должно привести к полному пересчету данных документа; Ложь - будут пересчитаны только измененные данные</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ЕстьОшибкиРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПланПроизводства</name>
    <type>
      <types>DocumentRef.ПланПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разделитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииТоварногоПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВыпускПолуфабрикатов</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланПроизводстваПересчет</name>
    <type>
      <types>DocumentRef.ПланПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/Reports/СбалансированностьПлановУП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
	Настройки.События.ПередЗаполнениемПанелиБыстрыхНастроек = Истина;
КонецПроцедуры

// Вызывается в одноименном обработчике формы отчета после выполнения кода формы.
// Подробнее - см. ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных - Настройки для загрузки в компоновщик настроек.
Процедура ПередЗагрузкойВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
	
	Планирование.СбалансированностьПлановПередЗагрузкойВариантаНаСервере(Форма, НовыеНастройкиКД);
	
КонецПроцедуры

// Вызывается до перезаполнения панели настроек формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   ПараметрыЗаполнения - Структура - Параметры, которые будут загружены в отчет.
//
Процедура ПередЗаполнениемПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
	
	Если ПараметрыЗаполнения.ИмяСобытия = "ПриОбновленииСоставаПользовательскихНастроекНаСервере" Тогда
		
		Планирование.СбалансированностьПлановПередЗагрузкойПользовательскихНастроекНаСервере(Форма, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Планирование.СбалансированностьПлановОбработкаПроверкиЗаполнения(КомпоновщикНастроек, Отказ);
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Планирование.СбалансированностьПлановПриКомпоновкеРезультата(КомпоновщикНастроек, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
	Сценарий = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек.ПользовательскиеНастройки, "Сценарий");
	Период	= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек.ПользовательскиеНастройки, "Период");
	
	ВыполнитьФоновоеПроведение(Сценарий.Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Процедура ВыполнитьФоновоеПроведение(Сценарий)

	УстановитьПривилегированныйРежим(Истина);
	
	ВыводитьОчередь = Ложь;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОчередьРасчетаПланаПроизводства.ПланПроизводства КАК ДокументСсылка
		|ИЗ
		|	РегистрСведений.ОчередьРасчетаПланаПроизводства КАК ОчередьРасчетаПланаПроизводства
		|ГДЕ
		|	ОчередьРасчетаПланаПроизводства.Сценарий = &Сценарий");
		
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		ТаблицаРезультат = Результат.Выгрузить();
		Для каждого Элемент Из ТаблицаРезультат Цикл
			Планирование.ЗапускВыполненияФоновогоПроведения(Элемент.ДокументСсылка);
		КонецЦикла; 
		ВыводитьОчередь = Истина;
		
	Иначе
		ВыводитьОчередь = Ложь;
	КонецЕсли;
	
	Для каждого Элемент Из КомпоновщикНастроек.Настройки.Структура Цикл
		Если Элемент.Имя = "Очередь" Тогда
			Элемент.Использование = ВыводитьОчередь;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
